Very strange. Seems to be working today:

```
  + resource "argocd_application" "external_secrets_controller" {
      + id   = (known after apply)
      + wait = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app-type" = "core"
            }
          + name             = "external-secrets"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project = "sre-infra"

          + destination {
              + namespace = "kube-system"
              + server    = "###"
            }

          + source {
              + chart           = "kubernetes-external-secrets"
              + repo_url        = "https://external-secrets.github.io/kubernetes-external-secrets/"
              + target_revision = "7.2.0"
            }
        }
    }
```

Apologies, must have been my set up locally, messed up state or something. 